{
    "indirect-light": "Indirect light is sunlight that either passes through a medium—a window shade or the leaves of a tree—or reflects off another surface before reaching a plant. Most indoor settings only provide indirect light. Indirect sunlight ranges from the bright indirect light of east-facing windows to the fainter, indirect light of north-facing windows. <br><br> For more information about lighting, visit <a target='_blank' rel='noopener noreferrer' href='https://www.masterclass.com/articles/how-to-find-the-right-sunlight-levels-for-plants#what-is-partial-direct-sunlight'>Master Class</a>.",
    "partial-light": "“Partial sun” or “partial shade” means that the plant needs 3-6 hours of direct sun per day. The terms sometimes are used interchangeably. However, being shaded in the morning is not the same as being shaded from the scorching afternoon sun. <br><br> For more information about partial lighting, visit <a href='https://meadowsfarms.com/lawn-garden/gardening-tips-and-information/excerpt-from-a-handbook-for-gardening-in-nova/what-does-full-sun-really-mean/' target='_blank' rel='noopener noreferrer'>Meadow Farms</a>.",
    "direct-light": "When it comes to the type of light plants need, the term “direct sunlight” almost always refers to unfiltered outdoor sunlight. Some indoor settings can provide direct light conditions—most notably floor-to-ceiling glass windows (ideally facing south in the northern hemisphere, or north in the southern hemisphere). <br><br> For more information about lighting, visit <a target='_blank' rel='noopener noreferrer' href='https://www.masterclass.com/articles/how-to-find-the-right-sunlight-levels-for-plants#what-is-partial-direct-sunlight'>Master Class</a>.",
    "fruits-and-veggies": "What a plant wants, what a plant needs —Plants are like people, but better. Each type of plant has a unique “personality“ and likes different things (water, sunlight, soil type, different hats, etc.). Some plants like it hot and sunny, while others like it cooler or moister (or both). When choosing the right plants for your garden, the USDA offers a helpful map that shows which plants are most likely to grow in which parts of the U.S. <br><br> Visit <a href='https://www.thespruce.com/gardening-4127780' target='_blank' rel='noopener noreferrer'>the Spruce</a> for more gardening information.",
    "flowers": "A quick guide for flower gardening for beginners. Learn how to create a beautiful flower garden for annual flowers and perennial flowers. <br><br> <b>Sun is essential.</b> <br><br> Building a flower takes a lot of energy, and all a plant's energy comes from the sun. So most flowering plants need a full-sun site -- where sunlight falls 6 to 8 hours a day all through the growing season. Try Burpee's Sunlight Calculator to test the amount of sun your garden receives. <br><br> <b>Success is in the soil.</b> <br><br> Good soil -- not too sandy, not too sticky, with enough organic matter to make it drain well and be inviting to plant roots -- is essential for successful flower gardening, just as it is for vegetables. After all, vegetables such as squash and tomatoes are formed from flowers. Test the pH and fertility of your soil. <br><br> <b>Annuals and perennials.</b> <br><br> As far as gardens are concerned, these are the two basic kinds of flowering plants. Annuals go through their whole life cycle in one growing season: sprouting from a seed, growing leaves and roots, producing flowers, creating seeds and then dying. They are popular with gardeners because, with reasonable care, they bloom their heads off all season. Perennials are plants whose root systems stay alive underground for several years or even decades. The part above the soil may go dormant and die back in winter, but the plant is still alive and will sprout again in spring. The tradeoff for perennials' long life is that they bloom for only a few weeks or months each year. Exactly when and how long varies between species. <br><br> <b>Which is better?</b> <br><br> Both have their uses in the garden. Annuals are great for places where you want a lot of flowers, but they generally need more watering, fertilizing and other care than perennials, and planting them every year can be a chore. Perennials provide steady structure and form to a garden, and many gardeners delight in the anticipation of waiting for their favorites' bloom time. Few are truly plant-it-and-forget-it, but they do tend to need less care than annuals. <br><br> <a href='https://www.burpee.com/gardenadvicecenter/annuals/general-gardening/flower-gardens/article10014.html' target='_blank' rel='noopener noreferrer'>Visit Burpee for more information on gardening</a>",
    "patio-plants": "Whether you have a yard or garden at all doesn’t matter. As long as you have a balcony, patio, or deck, you can fill it with plants and flowers. An easy to care for patio garden can be simple if you choose the right plants, those that do well in pots and require little maintenance to thrive. Some easy to grow container plants include: <br><br> <b>Herbs:</b> <br><br> If you have a sunny patio, herbs will thrive. You’ll also get to enjoy the smell and use them in the kitchen. Try basil, lavender, sage, thyme, rosemary, mint, and oregano. All they really need to grow well is sun and regular water.<br><br> <b> Ferns:</b><br><br> Shady patios are great for ferns. Choose different varieties in a range of textures and sizes for visual interest. <br><br> <b>Succulents:</b><br><br> For hot, dry climates, choose several succulents to combine in one large container for a striking look. Some examples include echeveria, saxifraga, and sedum. You don’t even have to water these often. <br><br> <b>Geraniums:</b> <br><br> For color, try geraniums. These cheerful annuals will survive a few missed waterings and will last all summer. <br><br> Read more at Gardening Know How: Low Maintenance Patio Plants: Grow An Easy To Care For Patio Garden <a href='https://www.gardeningknowhow.com/special/containers/low-maintenance-patio-plants.htm' target='_blank' rel='noopener noreferrer'>https://www.gardeningknowhow.com/special/containers/low-maintenance-patio-plants.htm</a>"
}